function fill() {
    const body = document.querySelector('body');
    const h1 = document.createElement("h1")
    h1.textContent = "Бореална Гора/Тайга";
    body.appendChild(h1)
    const backBtn = document.createElement('button');
    backBtn.id = 'backBtn';
    backBtn.textContent = 'Назад';
    body.appendChild(backBtn)
    backBtn.addEventListener('click', ()=>{location.href = '../index.html'});
   
        const section = document.createElement("section");
        section.classList.add('fade')
        const p = document.createElement('p');
        p.textContent = `Бореалната гора (тайга) заема около 17% от площта на земята в земния пояс на далечното северно полукълбо. На север отвъд тази граница, тайгата се слива в циркулярна тундра. Бореалът представлява 29% от световната горска покривка.

        Това е биомон на растителност, съставен главно от конусовидни иглолистни дървета с  иглолистна форма, в среда, характеризиращи се с дълги зими и умерени до високи годишни валежи. Почвата на тайгата има малко хранителни вещества. Тя също може да замръзне, което затруднява установяването на много растения.
        
        Коренни дървета, като смърч, бор, лиственица и ела, са често срещани, тъй като са много добре приспособяеми  към климатичните условия. Тяхната тънка, конична форма минимизира натрупването на сняг по клоните, което позволява на дърветата да издържат тежестта на снега през зимата, без да се счупят. Малките окръжност и повърхност на иглите и восъчното покритие, позволяват на дървото да устои на силните студени ветрове. Поддържането на иглите през зимата позволява на дървото да фотосинтезира понякога през слънчевия, топъл зимен ден, и да започне фотосинтезията през пролетта, веднага щом температурите позволят.
        
        Животните, живеещи в тайгата, включват лисици, мечки, норки, катерици, докато по-големите включват: сиви вълци и техните разновидности: карибу (Канада), елени и лосове.
        
        Бореалната гора съхранява огромни количества въглерод, вероятно повече от умерените и тропически гори, съчетани в по-голяма част от торфищата.
        
        Бореалните гори са кръстени на Бореас, гръцкият бог на Северен вятър.`        
        section.appendChild(p)
        

 
        const button = document.createElement("button");
        
        button.textContent = 'Научи повече'
        button.addEventListener('click', ()=>{
            location.href = 'https://bg.wikipedia.org/wiki/%D0%A2%D0%B0%D0%B9%D0%B3%D0%B0'
        })
        
        
            body.appendChild(section)
            body.appendChild(button)  
        

}
